{
  "backend/main.mo": "Actor providing user-scoped scenario templates and current-scenario persistence with permission checks and CRUD operations.",
  "backend/migration.mo": "Initializes empty maps and counters for the new actor’s template and scenario state during migration.",
  "feature_evidence.json": "Feature evidence listing implemented features, associated files, components, and test IDs for tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend TypeScript files describing their purpose in the app.",
  "frontend/index.css": "Tailwind CSS config defining theme variables, light/dark mode palettes, and base styling.",
  "frontend/index.html": "HTML entry point loading the root React app with main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring authentication, scenario loading/autosave, and rendering the scenario builder and results.",
  "frontend/src/components/auth/AuthControls.tsx": "Login/logout UI for Internet Identity with principal display and query cache clearing.",
  "frontend/src/components/results/BreakdownTable.tsx": "Table component showing detailed per-weapon attacker/defender combat breakdown values.",
  "frontend/src/components/results/ChanceToKillCard.tsx": "UI card that lets users select a defender and displays the calculated probability of killing at least one model.",
  "frontend/src/components/results/DamageChart.tsx": "Shows a bar chart of expected damage per defender based on deterministic results.",
  "frontend/src/components/results/ExportButton.tsx": "Dropdown button allowing export of combat results as JSON or CSV.",
  "frontend/src/components/results/HistogramChart.tsx": "Renders a histogram of damage frequencies from simulation results.",
  "frontend/src/components/results/ResultsDisplay.tsx": "Main results view handling deterministic and simulation modes, rendering charts, summaries, and export options.",
  "frontend/src/components/results/SimulationControls.tsx": "Provides input and button to run Monte Carlo simulations with configurable iteration count.",
  "frontend/src/components/results/SummaryCard.tsx": "Displays total expected damage and kills plus a breakdown of kills per defender.",
  "frontend/src/components/scenario/AttackerUnitEditor.tsx": "Editor for attacker units allowing modification of name, model count, and weapons.",
  "frontend/src/components/scenario/DefenderEditor.tsx": "Editor for defender units enabling changes to stats like model count, toughness, save, wounds, and invuln.",
  "frontend/src/components/scenario/PresetsPanel.tsx": "Empty file placeholder for scenario presets panel.",
  "frontend/src/components/scenario/PrioritySelector.tsx": "Card for selecting target priority mode with descriptive helper text.",
  "frontend/src/components/scenario/SavedTemplatesPanel.tsx": "UI panel for saving, loading, and deleting scenario templates with authentication handling.",
  "frontend/src/components/scenario/ScenarioBuilder.tsx": "Main editor for constructing combat scenarios, managing attackers, defenders, weapons, and template loading.",
  "frontend/src/components/scenario/WeaponEditor.tsx": "Form component for editing a weapon’s stats and special rules, with remove support.",
  "frontend/src/engine/chanceToKill.ts": "Computes approximate chance to kill models using expected damage and a normal-distribution approximation.",
  "frontend/src/engine/deterministicExpectedDamage.ts": "Calculates deterministic expected hits, wounds, and damage for a weapon against a defender, including special rules.",
  "frontend/src/engine/dice.ts": "Parses dice notation, computes average values, and performs random dice rolls.",
  "frontend/src/engine/priority.ts": "Sorts defenders according to selected targeting priority rules.",
  "frontend/src/engine/probability.ts": "Helpers for D6 reroll probabilities, wound/save logic, and related probability calculations.",
  "frontend/src/engine/random.ts": "Simple random D6 and D3 dice roll utilities.",
  "frontend/src/engine/resolveScenario.ts": "Computes deterministic expected combat outcomes across all attacker–defender pairs, generating damage totals, kill estimates, and a detailed breakdown.",
  "frontend/src/engine/simulation.ts": "Runs Monte Carlo simulations of combat scenarios, modeling rolls step‑by‑step to produce statistical outputs like mean, median, percentiles, and histograms.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity or actor changes.",
  "frontend/src/hooks/useCurrentScenarioPersistence.ts": "Provides React Query hooks to load and save the user's current scenario via the backend, handling authentication state.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value that updates after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, providing login, logout, stored identity restoration, and context for authentication.",
  "frontend/src/hooks/useSavedTemplates.ts": "Defines hooks to fetch, save, and delete user scenario templates through the backend using React Query.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables for light and dark themes with a Warhammer‑inspired palette.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and the Internet Identity provider before rendering App.",
  "frontend/src/models/combat.ts": "Defines TypeScript models for units, weapons, defenders, scenarios, and result structures for deterministic and simulated combat.",
  "frontend/src/presets/builtInPresets.ts": "Empty placeholder file for built‑in scenario presets.",
  "frontend/src/state/useScenarioState.ts": "Manages local scenario state with functions to add, remove, and update attackers, defenders, weapons, and priority settings.",
  "frontend/src/state/validation.ts": "Provides numeric and dice-notation validation helpers for scenario inputs.",
  "frontend/src/utils/exportResults.ts": "Exports combat scenario results to downloadable JSON or CSV files.",
  "frontend/src/utils/scenarioPersistence.ts": "Serializes and deserializes CombatScenario objects for backend-compatible storage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Metadata describing project version, architecture, features, and planned shifts in functionality."
}