{
  "backend/main.mo": "Motoko backend storing per‑user scenario templates and current scenarios with authorization checks and CRUD operations.",
  "feature_evidence.json": "Feature evidence listing implemented enhancements, affected files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Text file providing short summaries of all major frontend source files for reference.",
  "frontend/index.css": "Tailwind CSS base styles and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component handling auth, scenario state, autosave, and layout including builder and results.",
  "frontend/src/components/auth/AuthControls.tsx": "Login/logout UI using Internet Identity with principal display and state handling.",
  "frontend/src/components/results/BreakdownTable.tsx": "Component rendering a scrollable table of detailed attack‑defense breakdown rows.",
  "frontend/src/components/results/ChanceToKillCard.tsx": "UI card that selects a defender and displays the calculated probability of killing at least one model.",
  "frontend/src/components/results/DamageChart.tsx": "Renders a bar chart showing expected damage per defender based on deterministic results.",
  "frontend/src/components/results/ExportButton.tsx": "Provides a dropdown button to export combat results as JSON or CSV.",
  "frontend/src/components/results/HistogramChart.tsx": "Displays a histogram of simulated damage frequencies using bar widths scaled to counts.",
  "frontend/src/components/results/ResultsDisplay.tsx": "Main results container handling deterministic and simulation views, simulation execution, and layout of all result cards.",
  "frontend/src/components/results/SimulationControls.tsx": "Inputs and controls for running Monte Carlo simulations, including iteration count and a run button.",
  "frontend/src/components/results/SummaryCard.tsx": "Shows total expected damage, total kills, and kill breakdown per defender.",
  "frontend/src/components/scenario/AttackerUnitEditor.tsx": "Editor for attacker units allowing name, model count, and weapon management.",
  "frontend/src/components/scenario/DefenderEditor.tsx": "Editor for defender stats including model count, toughness, saves, wounds, and removal.",
  "frontend/src/components/scenario/PresetsPanel.tsx": "Empty file placeholder for scenario presets panel.",
  "frontend/src/components/scenario/PrioritySelector.tsx": "Selector card for choosing target priority mode with descriptive text.",
  "frontend/src/components/scenario/SavedTemplatesPanel.tsx": "UI panel for saving, loading, and deleting scenario templates with authentication checks and template list management.",
  "frontend/src/components/scenario/ScenarioBuilder.tsx": "Main scenario construction UI allowing creation and editing of attackers, defenders, weapons, priorities, and template operations.",
  "frontend/src/components/scenario/WeaponEditor.tsx": "Editor UI for configuring a weapon’s stats and special rules, with update and removal callbacks.",
  "frontend/src/engine/chanceToKill.ts": "Computes approximate kill probability using expected damage and a normal distribution approximation.",
  "frontend/src/engine/deterministicExpectedDamage.ts": "Calculates deterministic expected damage, hits, and wounds using probabilities, special rules, and dice averages.",
  "frontend/src/engine/dice.ts": "Parses dice notation, computes average values, and provides random dice rolling utilities.",
  "frontend/src/engine/priority.ts": "Sorts defender models based on selected target priority modes.",
  "frontend/src/engine/probability.ts": "Provides probability helpers for hit, wound, and save calculations including reroll logic.",
  "frontend/src/engine/random.ts": "Utility functions for rolling D6 and D3 values randomly.",
  "frontend/src/engine/resolveScenario.ts": "Computes deterministic expected damage for a combat scenario, tracking per-attacker/defender damage and expected kills.",
  "frontend/src/engine/simulation.ts": "Runs Monte Carlo simulations of combat, resolving hits, wounds, saves, damage, and FNP to produce aggregate damage statistics.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentScenarioPersistence.ts": "Provides hooks to load and save the user's current scenario via the backend actor.",
  "frontend/src/hooks/useDebouncedValue.ts": "Returns a debounced version of a value after a specified delay.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context managing Internet Identity login, stored identities, and status tracking.",
  "frontend/src/hooks/useSavedTemplates.ts": "Exposes hooks to fetch, save, and delete user scenario templates through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom color palette for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/models/combat.ts": "Defines TypeScript models for weapons, units, scenarios, combat results, and simulation outputs.",
  "frontend/src/presets/builtInPresets.ts": "Empty preset file reserved for built‑in scenario templates.",
  "frontend/src/state/useScenarioState.ts": "React hook managing CombatScenario state with add/remove/update functions for attackers, defenders, weapons, and priority.",
  "frontend/src/state/validation.ts": "Provides numeric and dice-notation validation helpers for scenario input fields.",
  "frontend/src/utils/exportResults.ts": "Exports scenario results to downloadable JSON or CSV using browser Blob APIs.",
  "frontend/src/utils/scenarioPersistence.ts": "Serializes and deserializes CombatScenario objects to backend-friendly string formats.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based routing params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata outlining architecture, features, models, and planned development direction."
}