{
  "kind": "build_request",
  "title": "Add defender damage modification step (flat reduction and half damage) after saves and before Feel No Pain",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Extend the DefenderModel TypeScript data model to support defender-side damage modification that applies after failed saves (including invulnerable saves) and before Feel No Pain. Add two optional fields: (1) a flat per-unsaved-wound damage modifier (e.g., -1) and (2) a boolean to halve damage (minimum 1). Ensure these fields round-trip through scenario serialization/deserialization and are available everywhere DefenderModel is used.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "We need to add the ability for the defender to have damage modifier too... can modify the damage by -1... half damage... Damage modification comes after saving rolls, both standard and invulnerable"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/models/combat.ts` DefenderModel includes two new optional fields for damage modification (flat modifier and halve-damage toggle).",
        "Existing scenario persistence (JSON stringify/parse via `frontend/src/utils/scenarioPersistence.ts`) continues to work with old saved scenarios that do not have the new fields (fields remain optional).",
        "No backend schema changes are required to store these new fields because scenarios are persisted as JSON strings and the new fields are optional."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Update the Scenario Builder UI to let users configure defender damage modification. Add controls to `DefenderEditor` to set (a) a flat per-unsaved-wound damage modifier value (allow negative values such as -1) and (b) a toggle for half damage. Use clear English labels and brief helper text indicating this step is applied after saves and before Feel No Pain.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "We need to add the ability for the defender to have damage modifier too... can modify the damage by -1... half damage... Damage modification comes after saving rolls, both standard and invulnerable"
        ]
      },
      "acceptanceCriteria": [
        "Defender editor shows a numeric input for a flat damage modifier (e.g., -1) and a switch/checkbox for “Half damage”.",
        "Changing either control updates the in-memory scenario state and is reflected in subsequent calculations/results.",
        "If neither control is set, behavior is identical to current behavior (no change to results)."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Update the deterministic expected-damage engine to apply defender damage modification after the save step and before Feel No Pain. For deterministic calculations, apply the modifier to the weapon’s average damage per unsaved wound in this order: (1) apply flat modifier and clamp to minimum 1, (2) if halve-damage is enabled, halve and clamp to minimum 1, then (3) apply Feel No Pain mitigation. Ensure this affects all deterministic outputs that depend on expected damage (totals, per-defender aggregation, tables, and chance-to-kill).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Damage modification comes after saving rolls, both standard and invulnerable"
        ]
      },
      "acceptanceCriteria": [
        "`calculateExpectedDamage` applies damage modification strictly between the save step and Feel No Pain step.",
        "Flat modifier uses a minimum damage floor of 1 after applying the modifier.",
        "Half-damage uses a minimum damage floor of 1 after halving.",
        "Deterministic results (Summary totals, Breakdown table, Damage chart, and Chance-to-kill) change appropriately when the new defender fields are set."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Update the Monte Carlo simulation engine to apply defender damage modification after saves and before Feel No Pain on a per-unsaved-wound basis. For each unsaved wound: roll weapon damage, apply flat modifier with minimum 1, apply half-damage with minimum 1, then apply Feel No Pain rolls against the resulting damage.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Damage modification comes after saving rolls, both standard and invulnerable"
        ]
      },
      "acceptanceCriteria": [
        "Simulation results differ when defender damage modifier fields are enabled, consistent with the “after save, before Feel No Pain” timing.",
        "Flat reduction never reduces a wound’s damage below 1 in simulation.",
        "Half-damage never reduces a wound’s damage below 1 in simulation.",
        "When both flat reduction and half-damage are enabled, they apply in the documented order before Feel No Pain."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (no additional backend services).",
    "Do not modify files under `frontend/src/components/ui` or other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing UI labels and helper text."
  ],
  "nonGoals": [
    "Do not add new authentication mechanisms beyond existing Internet Identity.",
    "Do not implement additional Warhammer special rules beyond the requested defender damage modification step.",
    "Do not change target priority logic or sequential wound allocation behavior as part of this change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}