{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Defender damage modification step (flat reduction + half damage) between saves and Feel No Pain",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Extend DefenderModel with optional defender-side damage modification fields and keep scenario JSON persistence backward-compatible.",
      "acceptanceCriteria": [
        "`frontend/src/models/combat.ts` DefenderModel includes two new optional fields for damage modification (flat modifier and halve-damage toggle).",
        "Existing scenario persistence (JSON stringify/parse via `frontend/src/utils/scenarioPersistence.ts`) continues to work with old saved scenarios that do not have the new fields (fields remain optional).",
        "No backend schema changes are required to store these new fields because scenarios are persisted as JSON strings and the new fields are optional."
      ],
      "file_operations": [
        {
          "path": "frontend/src/models/combat.ts",
          "operation": "modify",
          "description": "Add two optional DefenderModel fields for defender-side damage modification (flat per-unsaved-wound modifier and a halve-damage toggle) so they are available across all usages."
        },
        {
          "path": "frontend/src/utils/scenarioPersistence.ts",
          "operation": "modify",
          "description": "Ensure scenario serialization/deserialization safely round-trips the new optional defender fields and remains compatible with previously saved JSON that does not include them."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add Scenario Builder controls to configure defender damage modification (flat modifier and half damage) with clear English guidance.",
      "acceptanceCriteria": [
        "Defender editor shows a numeric input for a flat damage modifier (e.g., -1) and a switch/checkbox for “Half damage”.",
        "Changing either control updates the in-memory scenario state and is reflected in subsequent calculations/results.",
        "If neither control is set, behavior is identical to current behavior (no change to results)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/scenario/DefenderEditor.tsx",
          "operation": "modify",
          "description": "Add a numeric input for a flat per-unsaved-wound damage modifier (allow negatives) and a Switch for “Half damage”, including brief helper text stating this applies after saves and before Feel No Pain. Use shadcn-ui form primitives already used in this file (Input, Label, Switch). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Apply defender damage modification in deterministic expected-damage calculations after saves and before Feel No Pain, with correct ordering and minimum-1 clamps.",
      "acceptanceCriteria": [
        "`calculateExpectedDamage` applies damage modification strictly between the save step and Feel No Pain step.",
        "Flat modifier uses a minimum damage floor of 1 after applying the modifier.",
        "Half-damage uses a minimum damage floor of 1 after halving.",
        "Deterministic results (Summary totals, Breakdown table, Damage chart, and Chance-to-kill) change appropriately when the new defender fields are set."
      ],
      "file_operations": [
        {
          "path": "frontend/src/engine/deterministicExpectedDamage.ts",
          "operation": "modify",
          "description": "Update calculateExpectedDamage to adjust the weapon’s average damage per unsaved wound by applying (1) defender flat modifier then clamp min 1, (2) optional half-damage then clamp min 1, and only then (3) apply Feel No Pain mitigation; ensure this happens after the save/fail-save logic."
        },
        {
          "path": "frontend/src/engine/resolveScenario.ts",
          "operation": "modify",
          "description": "Verify deterministic aggregations (totals, per-defender maps, breakdown rows, and derived expected kills) continue to reflect the updated calculateExpectedDamage output when the new defender fields are set."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Apply defender damage modification in Monte Carlo simulation per unsaved wound between saves and Feel No Pain, preserving ordering and minimum-1 clamps.",
      "acceptanceCriteria": [
        "Simulation results differ when defender damage modifier fields are enabled, consistent with the “after save, before Feel No Pain” timing.",
        "Flat reduction never reduces a wound’s damage below 1 in simulation.",
        "Half-damage never reduces a wound’s damage below 1 in simulation.",
        "When both flat reduction and half-damage are enabled, they apply in the documented order before Feel No Pain."
      ],
      "file_operations": [
        {
          "path": "frontend/src/engine/simulation.ts",
          "operation": "modify",
          "description": "Update simulation damage resolution to operate per unsaved wound: roll weapon damage, apply defender flat modifier (min 1), apply defender half-damage (min 1), then run Feel No Pain rolls against the resulting damage for that wound; sum across wounds."
        }
      ]
    }
  ]
}